Repository: MatheusZampolli1/Meu-app
Catalog: lib/l10n/app_*.arb
Languages: es

# appTagline
source: Your phone faster, safer, and smarter—effortlessly.
es: Tu teléfono más rápido, seguro e inteligente, sin esfuerzo.

# tabDashboard
source: Dashboard
es: Panel

# tabTuning
source: Tuning
es: Ajustes

# tabAutomation
source: Automation
es: Automatización

# dashboardHeroMessage
source: Unlock performance, security, and automation in one place.
es: Activa rendimiento, seguridad y automatización en un solo lugar.

# metricCpuTitle
source: CPU usage
es: Uso de CPU

# metricCpuSubtitle
source: Active processes and recent apps
es: Procesos activos y apps recientes

# metricRamTitle
source: RAM usage
es: Uso de RAM

# metricRamSubtitle
source: Memory available for new apps
es: Memoria disponible para nuevas apps

# metricStorageTitle
source: Free storage
es: Almacenamiento libre

# metricStorageSubtitle
source: Space for apps, photos, and videos
es: Espacio para apps, fotos y videos

# metricTemperatureTitle
source: Device temperature
es: Temperatura del dispositivo

# metricTemperatureSubtitle
source: Monitor overheating
es: Supervisa el sobrecalentamiento

# metricBatteryTitle
source: Battery level
es: Nivel de batería

# metricBatterySubtitle
source: Consider enabling power saver below 30%
es: Activa el ahorro de energía cuando baje del 30%

# buttonCacheGuide
source: Cache cleaning guide
es: Guía de limpieza de caché

# automationCardTitle
source: Automation rules
es: Reglas automáticas

# toggleAutoOptimize
source: Auto optimize on unlock
es: Auto Optimize al desbloquear

# toggleNightlyCleanup
source: Nightly cleanup reminder
es: Recordatorio de limpieza nocturna

# toggleFocusMode
source: Distraction-free focus
es: Enfoque sin distracciones

# toggleBatteryReminder
source: Low battery alert
es: Alerta de batería baja

# messageQuickOptimizeStarted
source: Started a rapid optimization routine.
es: Iniciamos una rutina rápida de optimización.

# messageQuickOptimizeFailed
source: Could not optimize automatically. Adjust it in Settings > Battery.
es: No fue posible optimizar automáticamente. Ajusta en Configuración > Batería.

# messageStorageGuideOpened
source: Storage settings opened. Clear caches from the system menus.
es: Se abrió el almacenamiento. Limpia cachés desde el menú del sistema.

# messageAutoOptimizePermission
source: Battery optimization exemption permission is required.
es: Se requiere permiso para ignorar optimizaciones de batería.

# messageAutoOptimizeEnabled
source: Automatic optimization scheduled for unlock.
es: Optimización automática configurada al desbloquear.

# messageAutoOptimizeDisabled
source: Automatic optimization disabled.
es: Optimización automática desactivada.

# messageNightlyPermission
source: Alarm scheduling permission is required.
es: Se requiere permiso para programar alarmas.

# messageNightlyEnabled
source: Nightly reminder scheduled.
es: Recordatorio nocturno configurado.

# messageNightlyDisabled
source: Nightly reminder cancelled.
es: Recordatorio nocturno cancelado.

# messageFocusEnabled
source: Enable Do Not Disturb to silence distractions.
es: Activa No molestar para silenciar distracciones.

# messageFocusDisabled
source: Focus hint disabled.
es: Sugerencia de enfoque desactivada.

# messageNotificationPermission
source: Allow notifications to receive alerts.
es: Permite notificaciones para recibir alertas.

# messageBatteryReminderEnabled
source: Low battery reminder enabled.
es: Aviso de batería baja activado.

# messageBatteryReminderDisabled
source: Low battery reminder disabled.
es: Aviso de batería baja desactivado.

# messageManualSettingsFallback
source: Open the system settings manually.
es: Abre manualmente la configuración del sistema.

# performanceProfileEconomy
source: Economy
es: Ahorro

# performanceProfileBalanced
source: Balanced
es: Balanceado

# networkProfileGaming
source: Gaming
es: Juegos

# networkProfileProductivity
source: Productivity
es: Productividad

# messageProfileApplied
source: Performance profile {performance} and network {network} sent to the system.
es: Perfil {performance} y red {network} enviados al sistema.

# actionSummary
source: Summary
es: Resumen

# messageManualAdjustmentsOpened
source: We opened the relevant settings so you can finish manually.
es: Abrimos los ajustes relevantes para que termines manualmente.

# dialogOptimizationTitle
source: Optimization summary
es: Resumen de la optimización

# dialogOptimizationContent
source: Estimated battery savings of {gain}% over the next hours. Tip: keep {performance} mode for long tasks.
es: Ahorro estimado de {gain}% de batería en las próximas horas. Consejo: mantén el modo {performance} en tareas largas.

# dialogPrimaryAction
source: Got it
es: Entendido

# messageShortcutFailure
source: Couldn't open automatically. Adjust manually in settings.
es: No se pudo abrir automáticamente. Ajusta manualmente en la configuración.

# dropdownPerformanceLabel
source: Performance profile
es: Perfil de rendimiento

# dropdownNetworkLabel
source: Network priority
es: Prioridad de red

# labelBrightnessControl
source: Brightness control
es: Control de brillo

# toggleLimitBackgroundTitle
source: Limit background apps
es: Limitar apps en segundo plano

# toggleLimitBackgroundSubtitle
source: Reduces energy usage for inactive apps
es: Reduce el consumo de energía de apps inactivas

# toggleAdaptiveBatteryTitle
source: Adaptive battery
es: Batería adaptativa

# toggleAdaptiveBatterySubtitle
source: Prioritizes power for frequently used apps
es: Prioriza energía para las apps más usadas

# messageDisplaySettingsOpened
source: Brightness settings opened for manual adjustment.
es: Se abrió la pantalla de brillo para ajustes manuales.

# labelDisplaySettings
source: Display settings
es: Config. de brillo

# messageBatterySettingsOpened
source: Battery settings opened.
es: Configuración de batería abierta.

# labelBatterySettings
source: Power saver
es: Ahorro de energía

# messageNetworkSettingsOpened
source: Network settings opened so you can prioritize connections.
es: Se abrieron los ajustes de red para priorizar conexiones.

# labelNetworkSettings
source: Network & Wi-Fi
es: Red y Wi-Fi

# buttonApplySystemSettings
source: Apply system settings
es: Aplicar ajustes del sistema

# insightCpuSpikeTitle
source: CPU at full throttle
es: CPU al máximo

# insightCpuSpikeBody
source: CPU usage is at {value}% right now. Close heavy apps or switch to Balance mode to cool down.
es: El uso de CPU está en {value}% ahora. Cierra apps pesadas o cambia a modo Balanceado para enfriar.

# insightCpuTrendTitle
source: CPU trend rising
es: Tendencia de CPU en aumento

# insightCpuTrendBody
source: Processing load increased by {value}% in the last minutes. Consider enabling an efficiency profile.
es: La carga de procesamiento aumentó {value}% en los últimos minutos. Considera activar un perfil eficiente.

# insightHighTempTitle
source: Device getting hot
es: Dispositivo calentándose

# insightHighTempBody
source: Temperature reached {value}°C. Ventilate the device or pause high intensity tasks.
es: La temperatura alcanzó {value}°C. Ventila el equipo o pausa tareas intensas.

# insightStorageLowTitle
source: Low storage available
es: Poco almacenamiento disponible

# insightStorageLowBody
source: Only {value} GB free remain. Run storage cleanup or move media to the cloud.
es: Quedan solo {value} GB libres. Ejecuta la limpieza de almacenamiento o mueve archivos a la nube.

# insightBatteryLowTitle
source: Battery running low
es: Batería baja

# insightBatteryLowBody
source: Battery is at {value}%. Activate power saver or connect your charger.
es: La batería está en {value}%. Activa el ahorro de energía o conecta el cargador.

# insightRamHighTitle
source: Memory usage high
es: Memoria exigida

# insightRamHighBody
source: Apps are using {value}% of RAM. Close background apps to avoid slowdowns.
es: Las apps usan {value}% de la RAM. Cierra procesos en segundo plano para evitar lentitud.

# insightAllGoodTitle
source: Everything optimized
es: Todo optimizado

# insightAllGoodBody
source: Fluxon is keeping performance and temperature under control. Keep it up!
es: Fluxon mantiene controlados rendimiento y temperatura. ¡Buen trabajo!

# automationRuleSectionTitle
source: Intelligent automation
es: Automatización inteligente

# automationRuleSectionSubtitle
source: Create rules that react to battery, time or unlock events.
es: Crea reglas que reaccionan a la batería, horario o desbloqueo.

# automationRunRulesNow
source: Run rules now
es: Ejecutar reglas ahora

# automationCreateRule
source: New automation rule
es: Nueva regla de automatización

# automationRuleCreatedMessage
source: {name} activated. Fluxon will monitor it from now on.
es: {name} está activa. Fluxon la vigilará a partir de ahora.

# automationRuleNoExecutionMessage
source: No rules were triggered. Adjust the conditions if needed.
es: Ninguna regla se disparó. Ajusta las condiciones si es necesario.

# automationRuleExecutedMessage
source: Executed {count} automation(s).
es: Se ejecutaron {count} automatización(es).

# automationDeleteRule
source: Delete
es: Eliminar

# automationConditionUnlock
source: When the device is unlocked
es: Cuando el dispositivo se desbloquea

# automationConditionBattery
source: When battery goes below {value}%
es: Cuando la batería baja de {value}%

# automationConditionTime
source: Around {value}
es: Alrededor de {value}

# automationConditionBatteryLabel
source: Battery level
es: Nivel de batería

# automationConditionTimeLabel
source: Time of day
es: Hora del día

# automationRuleFormTitle
source: New automation rule
es: Nueva regla de automatización

# automationRuleNameLabel
source: Rule name
es: Nombre de la regla

# automationRuleNameError
source: Give this rule a name.
es: Asigna un nombre a esta regla.

# automationConditionLabel
source: Condition
es: Condición

# automationActionLabel
source: Action
es: Acción

# automationConditionBatteryInput
source: Trigger when battery is at {value}%.
es: Disparar cuando la batería esté en {value}%.

# automationConditionTimeInput
source: Trigger at {value}.
es: Disparar a las {value}.

# automationPickTimeButton
source: Choose time
es: Elegir hora

# commonCancel
source: Cancel
es: Cancelar

# commonSave
source: Save
es: Guardar

# automationActionQuickOptimize
source: Run quick optimization
es: Ejecutar optimización rápida

# automationActionNightlyCleanup
source: Schedule nightly cleanup
es: Programar limpieza nocturna

# automationActionOpenBattery
source: Open battery settings
es: Abrir ajustes de batería

# automationActionOpenDisplay
source: Open display settings
es: Abrir ajustes de pantalla

# automationActionOpenNetwork
source: Open network settings
es: Abrir ajustes de red

# automationQuickShortcutsTitle
source: Shortcuts
es: Accesos directos

# automationEmptyState
source: No automation rules yet. Create one to automate your routine.
es: No hay reglas todavía. Crea una para automatizar tu rutina.

# automationDefaultRuleName
source: Fluxon Rule
es: Regla Fluxon
